---
kind: method
id: M:Autodesk.Revit.DB.GBXMLImportOptions.#ctor
source: html/331d05f0-d8a2-6c69-f327-24f6c6c65d75.htm
---
# Autodesk.Revit.DB.GBXMLImportOptions.#ctor Method

Default constructor. Sets all options to their default values.

## Syntax (C#)
```csharp
public GBXMLImportOptions()
```